# Dataframe structure

In [26]:
# Importing pandas
import pandas as pd

In [27]:
# creating a dataframe
people = {
    "Name" : ['Juan', 'Carlos', 'Antonio', 'Maria', 'Lucia'],
    "Surname" : ['Rodrigez', 'Perez', 'Delfin', 'Rivera', 'Grande'],
    "Age": [23, 32, 36, 44, 32],
    "Email": ['JuanR@mail.com', 'Carlos@mail.com', 'A.Delfin@mail.com', 'MariaRivera@mail.com', 'Lucia.G@mail.com'],
}

people_df = pd.DataFrame(people)
people_df

      Name   Surname  Age                 Email
0     Juan  Rodrigez   23        JuanR@mail.com
1   Carlos     Perez   32       Carlos@mail.com
2  Antonio    Delfin   36     A.Delfin@mail.com
3    Maria    Rivera   44  MariaRivera@mail.com
4    Lucia    Grande   32      Lucia.G@mail.com

In [28]:
# Accessing acolumn on a dataframe
# Also possible by (dot notation) people.Age
people_df['Age']

0    23
1    32
2    36
3    44
4    32
Name: Age, dtype: int64

In [29]:
# Pandas dataframe is a onedimensional array, each of the colums is one series
type(people_df['Age'])

pandas.core.series.Series

In [30]:
# Accessing multiple columns
people_df[['Name', 'Surname']]

      Name   Surname
0     Juan  Rodrigez
1   Carlos     Perez
2  Antonio    Delfin
3    Maria    Rivera
4    Lucia    Grande

In [31]:
# Get the columns of a dataframe
people_df.columns

Index(['Name', 'Surname', 'Age', 'Email'], dtype='object')

## iloc
Index locator

In [32]:
# Accessing a row
people_df.iloc[0]

Name                 Juan
Surname          Rodrigez
Age                    23
Email      JuanR@mail.com
Name: 0, dtype: object

In [33]:
# Accessing multiple rows
people_df.iloc[[0, 1]]

     Name   Surname  Age            Email
0    Juan  Rodrigez   23   JuanR@mail.com
1  Carlos     Perez   32  Carlos@mail.com

In [34]:
# Accessing a row at index
people_df.iloc[[0, 1], 1]

0    Rodrigez
1       Perez
Name: Surname, dtype: object

## loc
locator

In [35]:
# Accessing a row at index
people_df.loc[[0, 1], ['Surname']]

    Surname
0  Rodrigez
1     Perez

In [36]:
# Slicing can be use, as follows
# The last value in dataframe slicing is inclusive
people_df.loc[1:3, 'Surname':]

  Surname  Age                 Email
1   Perez   32       Carlos@mail.com
2  Delfin   36     A.Delfin@mail.com
3  Rivera   44  MariaRivera@mail.com

# Index

In [37]:
people_df.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
# Inplace argument makes the changes permanent
people_df.set_index('Email', inplace=True)
people_df.index

Index(['JuanR@mail.com', 'Carlos@mail.com', 'A.Delfin@mail.com',
       'MariaRivera@mail.com', 'Lucia.G@mail.com'],
      dtype='object', name='Email')

In [39]:
people_df.sort_index()

                         Name   Surname  Age
Email
A.Delfin@mail.com     Antonio    Delfin   36
Carlos@mail.com        Carlos     Perez   32
JuanR@mail.com           Juan  Rodrigez   23
Lucia.G@mail.com        Lucia    Grande   32
MariaRivera@mail.com    Maria    Rivera   44